{"meta":{"title":"Charley's Hut","subtitle":"","description":"","author":"Charley Xiao","url":"http://charleyhut.github.io","root":"/"},"pages":[{"title":"About","date":"2023-01-26T06:42:20.175Z","updated":"2023-01-26T06:42:09.448Z","comments":true,"path":"about.html","permalink":"http://charleyhut.github.io/about.html","excerpt":"","text":"你好！欢迎来到我的小屋。在这个博客里我将会记录我的一些学习笔记，包括算法学习、语言学习等。欢迎交流！"},{"title":"","date":"2023-01-26T06:30:07.145Z","updated":"2023-01-26T06:30:00.175Z","comments":true,"path":"categories.html","permalink":"http://charleyhut.github.io/categories.html","excerpt":"","text":""},{"title":"","date":"2023-01-26T06:29:29.358Z","updated":"2023-01-26T06:29:24.663Z","comments":true,"path":"tags.html","permalink":"http://charleyhut.github.io/tags.html","excerpt":"","text":""}],"posts":[{"title":"Daddish","slug":"daddish","date":"2023-01-26T06:41:08.310Z","updated":"2023-01-26T06:42:10.459Z","comments":true,"path":"2023/01/26/daddish/","link":"","permalink":"http://charleyhut.github.io/2023/01/26/daddish/","excerpt":"","text":"DaddishLast Edited: 2022/05/04 &amp; 2022/10/04(Not Updated) WelcomeWelcome to the tutorial of Daddish, a constructed language created by me. From the following tutorial, you will acquire a basic knowledge of the grammar of Daddish and learn to speak it. IntroductionDaddish is the official language of Dad Republic (Daddish: Konharmonёšost Dadad), Earth 0xffffffff. Daddish was invented by a linguist, Vasily Xiao (Daddish: Šjao Vasinёo), and has been promoted nationwide in Dad Republic since its birth. Resources Memorizing Daddish Words Daddish Culture, History, Art, Literature Etc FeaturesWhy should you learn Daddish? Well, for fun, of course! Apart from that, Daddish has some amazing features, including: 9 Grammar Cases; Simple Construction of Words (you can literally construct any word based on its meaning); Restrictive/Non-restrictive Adjectives; Vowel Harmony; Etc… So, let’s get started! Overview Alphabet Verb Construction Person&amp;Number Time&amp;Type Voice Noun Construction Article Case Adjective&amp;Adverb Basic Structure Compound Structure Preposition Not-Attributive-Clause Active Verb-adjective Passive Verb-adjective Not-Nominal-Clause Not-Adverbial-Clause Text Dictionary AlphabetThe alphabet of Daddish is pretty easy, which includes all the letters of the English alphabet except q, w, x and y. And there are also š and č, which respectively represent the sounds sh (as in shove) and ch (as in chance). The letter ё represents the sound [jo], same as that in Russian. Letters (Capital) Letters (Lower) Pronunciation A a /a/ B b /b/ C c /ts/ D d /d/ E e /e/ F f /f/ G g /g/ H h guttural /h/ I i /i/ J j /j/ K k /k/ L l /l/ M m /m/ N n /n/ O o /o/ P p /p/ R r /r/ S s /s/ T t /t/ U u /u/ V v /v/ Z z /z/ Š š /ʃ/ Č č /tʃ/ Ё ё /jo/ VerbConstructionThe verbs in Daddish are very constructed. The original form of a verb always ends with č. If we take that č away, we call the rest the root of the verb. Basically a conjugated verb looks like this:$$\\rm (Negative\\ Prefix)+(Directional\\ Prefix)+(Aspect\\ Prefix)+Root+Person+Number+Time&amp;Type+(Voice)$$Besides, note that, for the suffixes to attach, it follows the rule of vowel harmony. The vowels in suffixes are always consistent with the last vowel of the root (with a few exceptions). Additionally, when attaching a suffix, you need to pay attention to the end of the word. Let’s say you are attaching the suffix f to the morpheme lek. lek ends with a consonant k, so it should be lekef after conjugation. Similarly, if the ending is a vowel, f becomes fa/fe/fi/fo/fu instead of af/ef/if/of/uf. Person&amp;NumberIn Daddish, the concept of “plural” doesn’t work. Daddish has three types of numbers: Singular, Type II and Type III. Singular, also Type I, is used to represent things in total of 1. Type II is used for 2,3,4 and numbers that end with 2,3,4. Type III is for those that cannot fit in Type I or Type II. Here comes the conjugation table of $\\rm Person$: First Person Second Person Third Person f r (Inclusive) / ss (Exclusive) t And $\\rm Number$: Singular Type II Type III (None) v k Thankfully this works for nouns too! Example: (a) machine (2,3,4…) machines (5…) machines maščin maščiniv maščinik Time&amp;TypeTense consists of aspect and time. There are three times in Daddish: Past, Present, and Future. There are also three types: declarative, imperative, and reportative. Reportative is used when the speaker is reporting what was told. Past Present Future Declarative m š g Imperative šd šd šd Reportative lm tš tg Now that you have learned all the basic verb conjugation, we can make some sentences: Seve leporokotovolm sjadvimaščinih. They(Type II) are said to have got a car. Se (He)+ ve= Seve (They,Type II) le (come)+ po (perfective prefix)+ rok (hand)+ č= leporokč (to get) leporok (root of to get)+ ot (third person)+ ov (Type II)+ olm (past reportative)= leporokotovolm (are said to have got) sjad (self)+ vi (move)+ maščin (machine)+ ih (accusative)= sjadvimaščinih(car, accusative) VoiceFor passive voice, a -sja/sje/sji/sjo/sju is attached to the conjugated verb. The vowel depends on the root. For active voice, this is not needed. NounConstructionThe nouns in Daddish are usually constructed in such way:$$\\rm Prefix+Root+Suffix\\ with\\ a\\ Meaning+Number+Case+Article$$We have already discussed the $\\rm Number$ in the previous section. ArticleIn Daddish, there is only definite article. But the definite article can sometimes be omitted, and sometimes can even express the meaning of “that/this/those/these”. The definite article looks like this:$$\\rm …-ta/te/ti/to/tu$$The vowel, again, should be in line with the root’s. Articles don’t do case conjugation. CaseThere are nine grammar cases in Daddish: Nominative (None) Genitive d Dative z Accusative h Instrumental $\\rm [vowel]+hm$ or $\\rm [consonant]+[vowel]+hm$ Locative p Topicative c Ablative b Vocative s NominativeThe nominative case marks the subject of a verb. When the verb is active, the nominative is the person or thing doing the action; when the verb is passive, the nominative is the person or thing receiving the action. Malcik-ti glazatam boloh-to. The boy saw the ball. Bol-to glazatamsja malcikihm-ti. The ball was seen by the boy. GenitiveThe genitive case has the basic usage of showing possession, along with other derived usage. possession thinkik Dzaneted Janet’s drinks composition kup manakad a group of men reference kapital konharmonёšostod-to capital of the republic DativeThe dative case is used to mark the indirect object. Se darokotom malcikiz giftih. He gave a boy a gift. It can be also used to express the meaning of “to somebody”. Seze ce delo tovnёo. To him, it is a good deed. AccusativeThe accusative case is used to mark a direct object, or after a few prepositions. Tehe amofošo. I love you. Musufug fu-dvaha sekunduvud. I will talk for two seconds. InstrumentalThe instrumental case shows the meaning of “by means of” or “by use of”, or, in passive voice, shows the implementer of an action. Pišifiš penehm. I’m writing with a pen. Bol-to glazatamsja malcikihm-ti. The ball was seen by the boy. LocativeThe locative case shows the location or time. Moskvapa ce komennёe. In Moscow, this is common. TopicativeThe topicative case is a unique case in Daddish. It marks the topic, usually something the speaker is talking about. Šotoc ke knosotoš-c! About death, who knows! It can also be used to change the structure of the sentence for whatever reason. Ekzamac Gokanёac, se častandataš cepe. He is taking part in the National Exam. AblativeThe ablative case expresses the meaning of “out of” or “from”. Ce hobotomsjo manab. This was stolen from a man. VocativeThe vocative case is a grammatical case which is used for a noun that identifies a person (animal, object, etc.) being addressed. Dzjonos, verešd! John, come! Adjective&amp;AdverbBasic StructureIn Daddish, there are two types of adjectives: restrictive and non-restrictive. The original form of a restrictive adjective ends with tornё, while a non-restrictive one just ends with nё. And adjectives also conjugates:$$\\rm …nё+[the\\ last\\ vowel\\ in\\ the\\ root\\ of\\ the\\ modified\\ noun]+[corresponding\\ case\\ ending,\\ just\\ like\\ a\\ noun]$$ Djakak kelez titekez tovnёeze! Thanks to all great teachers. (non-restrictive, indicating all teachers are great, and thanking all the teachers) Djakak kelez titekez tovtornёeze! Thanks to all teachers who are great! (restrictive, indicating you are only thanking good teachers, not bad ones) Adverbs are often derived from adjectives, by changing the nё into no. Adverbs never conjugate. Compound StructureNon-restrictive: Prinscipl Vzimvidostod uroktoknёi Einsteinehm ku šokotomnёi fizikmestostod Principle of Relativity, which was put forward by Einstein and shocked the field of physics The adherent adjuncts are connected with ku, which means and. al can be also used, which means or. Restrictive: rubblat-ta s-vahtahm Viniidi kutor ustoktornёa fu-markostoh that red pen with Winnie the Bear on it which is used for marking The adherent adjuncts are connected with kutor instead of ku, and altor instead of al. Preposition Preposition Meaning Case Required fu for Acc. s with Ins. oz against Gen. vkruh around Gen. bifuh before(time) Acc. aft after(time) Acc. ans inside Loc. cent at the center of Gen. em among Gen. fprid in front of Gen. znafp before(space) Gen. čerz through, over Acc. undeh under Ins. dov lasting for(time) Acc. vza while, when Gen. til until Gen. ot because of Gen. lefi in order to, for Gen. sin within Acc. oht without Gen. vasi thanks to Acc. Not-Attributive-ClauseBreaking news: there is no such thing as an “attributive clause” in Daddish! The meaning of the clause is expressed by compound structure, which consists of special adjectives derived from verbs and other stuffs. Active Verb-adjectiveAn active verb-adjective is used to modify a noun that is the implementer of an action. An active verb-adjective is constructed on the basis of a verb.$$\\rm Active\\ Verb-adjective=[conjugated\\ verb]+(tor)+nё$$For example: šokč (to shock)&gt; šokotom (shock, third person, past)&gt; šokotomnё (which shocked) Passive Verb-adjectiveA passive verb-adjective is used to modify a noun that is the patient of an action. A passive verb-adjective is also constructed on the basis of a verb, but has two different structures:$$\\rm [conjugated\\ verb]+(tor)+nё$$or$$\\rm [verb\\ without\\ suffix\\ or\\ č]+tok+nё$$The first one gives the exact information of the action, while the second doesn’t emphasize the time or person. And remember, the implementer of the action should be in instrumental case. For example: urokč (to put forward)&gt; uroktoknё (put forward, passive)&gt; uroktoknё Einsteinehm (put forward by Einstein) urokč (to put forward)&gt; urokotomsjonё (an object was put forward)&gt; urokotomsjonё Einsteinehm (an object put forward by Einstein) Not-Nominal-ClauseAnother breaking news: there is no such thing as a “nominal clause” in Daddish! The corresponding meaning is expressed by some structures. ObjectWhen the noun acts as an object in the “clause”, for example:$$\\rm I\\ know\\ \\underline{what}\\ she\\ has\\ said.$$Then the structure in Daddish looks like this:$$\\rm I\\ know,\\ she\\ [magic\\ word]\\ has\\ said.$$And the magic word is suhu. So the actual sentence looks like this:$$\\rm Knosofoš,\\ sa\\ suhu\\ pogavatam.$$Basically, suhu is put before the action in the “clause”, and altogether the structure becomes the object of knosofoš. But this is just basic. Actually, the true magic word is su, and suhu is the accusative case of it. The real rule is: If two parts share the same case, like the example above (both accusative), then put the su right before the action in the “clause” and change it into the correct case. If two parts don’t share the same case, then we need two su. They are put together like su-su, also right before the action in the “clause”. The first one conjugates according the main clause, and the second the subordinate clause. Knosofoš, sa suhu-supu zivitim. I know where she lived. And if there is a preposition: Memefeš, jeve sekundukuh bifuh suhu-oz-sudu photicifivim. I remember against whom we fought seconds ago. Not-Adverbial-ClauseMaterialsLesson 1: Meeting at a CafeA. TextKlor ku Ann musutuvuš čerz telefonoho. Klor: Dictionary Daddish English Daddish English je I drink te you (sing.) eat se he bite sa she suck ce this spit če that vomit cegda here blow čegda there breathe ket who laugh cet what see šat when hear gda where know (a fact) ko how think zna not smell kel all fear toma many sleep soma some live isma few kill otha other die ii one fight ai two hunt ci three hit fo four cut no five split ši six stab cem seven scratch osm eight dig dev nine swim des ten fly iičdes eleven walk aičdes twelve come cičdes thirteen lie fočdes fourteen sit nočdes fifteen stand šičdes sixteen turn cemčdes seventeen fall osmčdes eighteen hold devčdes nineteen squeeze aidesev twenty rub bignё big wash dninё long wipe zkonё wide pull honё thick push vecnё heavy throw šotnё short tie mlenknё small sew nahonё narrow count tinnё thin say uman woman sing man man (male) play human man (human being) float kit kid flow muman wife freeze maman husband swell uth mother sun path father moon zvunёšost animal star dag fish water ptic bird rain haund hound river laus louse lake zmja snake sea čoz worm salt riu tree stone riunost forest sand stik stick dust uvod fruit earth hum seed cloud liv leaf fog enhum root sky uriu bark (from a tree) wind cvet flower snow kas grass ice hop rope smoke uhuman skin fire nezvun meat ashes blood burn bone road fat (n.) mountain egg red horn green tail yellow feather white hair black head golden ear gold eye silver nose iron mouth steel tooth night tongue day fingernail afternoon foot noon leg evening knee year hand month wing week belly hour guts minute neck second back warm breast cold heart full liver new old pen good eraser bad desk rotten table dirty chair straight stool round toilet sharp class dull classroom smooth grade (1,2,3…) wet score dry goal correct dream near achievement far factory right airport left station name hall if cafeteria pencil house","categories":[],"tags":[{"name":"Gibberish","slug":"Gibberish","permalink":"http://charleyhut.github.io/tags/Gibberish/"}]},{"title":"我","slug":"ego","date":"2023-01-26T06:38:30.716Z","updated":"2023-01-26T06:42:13.313Z","comments":true,"path":"2023/01/26/ego/","link":"","permalink":"http://charleyhut.github.io/2023/01/26/ego/","excerpt":"","text":"当我想要翻过象牙山时，我遇到了两个同行者。他们对我的身体说，只要我朝着那座千铃摇响的庙宇念出魔咒，它的大门就会打开，一条通向山那边的路便会显现，而咒语就是我自己。于是我的灵魂对身体说：“念出咒语吧。” 但它是一个暴虐的灵魂，让身体辛苦干他那些自我满足的事情，而一旦完成，就荒唐地抛弃掉这个躯壳；一段时间后，它又会可怜兮兮地回来，央求柔弱的身体再次接纳它。想到这里，我的身体哭了起来。 “我的灵魂很可怕，”我的身体哭诉着，“我喝了点酒，才把它赶走一会儿。但它很快就会回来。啊，它很快就会回来。” 于是身体转了过去，拒绝翻过这座山：“如果我照你吩咐念出了咒语，又有什么好处？” 灵魂答道：“那么我会放过你。照我说的做。” 身体对着庙宇屋檐上摇曳的铃铛低声念着：“有一条河流穿过，一半是水晶，一半是秘密。有的做梦的人逃离那里，有的却前往那里。刚开始，有位少年名叫 K，他很少做梦，因为周围太嘈杂了；但是，在黄昏的时候，他会去寻找港口用梦做的双桅船。乘着它，有的人去东方，有的人去西方，有的人去过去，有的人去未来：因为人们总是厌恶自己的现状的，他也不例外。于是他选择回到过去的终点站，因为那里人们的叹息声最多，因为他想要在模糊的星光中找到过去的自己，哪怕瞥一眼也行。但是，梦船总是沿着厄运航行，一旦溜出黑夜，在黎明的阳光下便会立即消失。” “那位少年呢？”另外两个身体问道。 “他从传说之地离开，当时他正路过战火中的城市，那里的人正在争抢河里的水晶，那里还有骄横的士兵：于是他选择不下船。但是黎明到来了，船消失了，他也沉入河底。直到一天之后，在深夜里，河流将他的身躯轻柔地抬起来，放在刚到港口的梦船上，他便继续顺流而下。然后他到达了乌托邦，那里的人都高兴地活着，嘴里唱着不知名的歌，伴随着精灵的笛声与仙女共舞。于是他下船，跳了一整夜，看见了山楂树开花的盛况，听到了十年前的泪光倾洒在云上的声音，披着斗篷，戴着王冠。但是他知道，在一个世纪之后，自己便会厌烦这里的一切。于是他选择在下一天夜晚再次搭乘梦船。” “然后他去了哪里？” “他哪里也没去。梦船把他带到了一个什么都没有的地方，那里没有山岳，没有繁星，没有河流，没有草地，没有昼夜：什么都没有，只有他自己。他起初很惶恐，因为他知道自己在一个不存在的地方，它名叫‘未来’。但他又在苍茫中逐渐看到了茂盛的草地在一点一点地产生，不久后高高的紫花开得奇异耀眼，独角兽在山泉旁嬉戏。旁边的河中也有一架发光的大帆船，它开向不知名的远方。” “所以他来到了这里？” “是的。这些就是他应该念出的咒语。”我的身体说道，“但是让我休息吧，我累到极点了。” 也就是这时，一千个铃铛同时摇响，庙宇的大门缓缓打开。在金光散去之后，一条小道通向远处。 “看到海边了吗？”我的灵魂对身体说，“翻过这座山，到达那片沙滩，走进那层海浪中去，我便会离你而去，让你获得自由了。” 于是三个旅人一齐向那里走去。","categories":[],"tags":[{"name":"Novel","slug":"Novel","permalink":"http://charleyhut.github.io/tags/Novel/"}]},{"title":"草","slug":"grass","date":"2023-01-26T06:38:27.339Z","updated":"2023-01-26T06:42:15.556Z","comments":true,"path":"2023/01/26/grass/","link":"","permalink":"http://charleyhut.github.io/2023/01/26/grass/","excerpt":"","text":"前几天我去买了一盆草放在窗边。但是，这盆草有些不同寻常。 有一天晚上，大家正熟睡时，我从噩梦中惊醒。梦的内容我已经记不清了，但我花了好长时间静静地坐在床上，才把我的呼吸调整平稳。整理了思绪后，我准备下床上个厕所，也正是这是我听见了一个细小的声音： “大他者。” 它像一只充满黏液的蠕虫一样爬进了我的耳朵，我的身体不由自主地颤动了一下。我很确定，这个声音一定是那盆草发出来的，毕竟在买回它之前，我从来都没有在夜晚听到任何声音，更何况是这么晦涩的一个词。 我蹑手蹑脚地靠近窗台，害怕任何声响惊醒我的室友们。那盆草凝视着我，又悄悄说了声： “大他者。” 可我并不是什么大他者，我甚至不属于象征界，我只是把我的名字留在了那个地方。但一盆草会这样说，一定有它的道理：也许在它看来，我是父权秩序的一种象征，毕竟是我将它买下来的。尽管如此，无论我怎么称呼它，无论是谁将它买下的，草总不会度过什么所谓的“镜像阶段”，更不会产生对于自我的认知——至少在我眼中不会。这盆草相信大他者的存在，并以我充当大他者的位置，那么我到底是“理应知道的主体”还是“理应不知道的主体”？这个问题的答案并不重要，重要的是我已经成为了一种代理，也许这盆草从来没有相信过我甚至任何人，但它无论如何还是要指我为“大他者”，或许在它从未拥有的东西的失去中失去的正是统治它生命的一种“本质性表象”吧。 我问它： “为什么？” 但是这个问题一问出我便后悔了。我是否在向它询问一种意义，一种作为秩序的意义。如果是这样，既然封闭的符号系统已经将所有的设想都安排好了，那么这个问题也不会拥有答案。但也可能我只是出于礼貌而做出的一种回应，就像日常的寒暄一样，以期我们能够在这个场域内部继续我们的信息与利益交换？草当然知道我问“为什么”的虚伪，我也知道它知道，但至少它知道我愿意陪它进行这既定的对话，甚至，进一步说，这种愿意也是既定的。当然，我知道这是我需要付出的代价，为了与它对话必须做出的牺牲。但有些人，据我所知，狂热地迷恋和草对话，这也许不是因为它们真的爱草，或者想要让草给这个空间增添生机，而是因为草本身就提供一种迷人的图景：可以在寂静孤独的夜晚找到自己的同类人，从而规避梦魇带来的恐惧。我并非在批判这些人，我也可能是其中一员；我也不是想构建出什么意义系统，就像自欺欺人的齐奥塞斯库蒂米什瓦拉屠杀之后决定在布加勒斯特组织一场老套的报告大会来向“大他者”证明表象仍被维持。不可否认的是，不管大他者究竟于草来说是什么样的一种集合，草的生命尺度都是由这个系统来划分。比如也许这盆草只是在默默地向我忏悔，而我就是那个审判者。但是作为审判者的幻象总会破灭，尤其是当这盆草不再注重任何礼节而脱离了我们的对话系统时。也许我想多了，这盆草只是想与我进行主体互认的过程，所以难免表现出癔症的话语。它已经给出了它所不拥有的，因此我很难狠心去批判它的歇斯底里。其实就如同海德格尔所说的：“人是被抛到这个世界上的。”一旦失去符号性的支撑，我们便什么都不是了，我们只是因为象征债务的存在而苟活着，我们在别人的眼中只是我们的符号性位置，而只有在这种符号失去其效力的时刻，我们才能够领悟此在，认清我们的存在性空无。而这盆草就是这样的。我与它的关系不是亲密无间的，正相反，我与它的关系总是要以大他者作为中介，从而造就了紧张不安的氛围。它渴望知道我在夜晚醒来的欲望，可我也不知道我有什么欲望。我的那些欲望以及被碎片化地抛向了客体，可我却像傻瓜一样去追求苦中的原乐。这就是为什么我没法给它一个回复，于是我上床了。 第二天早上起来，我诧异地发现那盆草没了。于是焦急地问室友们有没有看到那盆草，但是他们却一致地回答： “什么草？”","categories":[],"tags":[{"name":"Novel","slug":"Novel","permalink":"http://charleyhut.github.io/tags/Novel/"}]},{"title":"伤","slug":"dolor","date":"2023-01-26T06:38:23.377Z","updated":"2023-01-26T06:42:11.580Z","comments":true,"path":"2023/01/26/dolor/","link":"","permalink":"http://charleyhut.github.io/2023/01/26/dolor/","excerpt":"","text":"“我想要拥有你的伤口。”他看着我，对我说道。 而我的身体上已经布满了鲜红的伤痕，它们宛如热恋中饥渴的嘴唇，于一张一翕中绽放着脆弱的美。 “但是它们会呻吟，会时不时喷出血雾。”我解释道。 正是这时，一条条红色的巨龙从伤痕中腾飞，在震耳欲聋的咆哮声中从地面冲进云里。云层霎时沾染了血，又在夕阳的映衬下向地面上的人们宣告血色的再次降临。然而，我身上的伤痕也因为吐出了自己的生命而开始艰难地喘息。 “所以，我们每一次看到晚霞，都有一个伤痕累累的人在受罪？”他用怜惜的目光看着我。 “是也不是。每个人都在受罪，只不过有些人的身上没有伤痕，他们自然也不会喘息，而正相反，他们会觉得晚霞很美丽；一旦拥有了，哪怕是一毫米的伤痕，在傍晚时分就会感到钻心的痛，这时，晚霞对于他们来说便是永恒的噩梦。” “但看起来你很爱这些伤痕？” “因为我与我自己正在热恋中，我会爱上我身体的一切。这些充满着生命色调的裂口就是我的挚爱，它们中每一个的诞生都是我自己在对我吐露着的心声，就如同呱呱落地的婴儿，尽管我不能理解它们的呢喃，我仍然能感受到一股生命的鲜腥。这当然是美好的。” “那么，我想要拥有你的伤口。”他又一次强调。 “你没法拥有我的伤口，因为它只能长在我的身上。” 他的目光稍显愠色，很明显可以看出他在无声地责怪我的自私和占有欲。 “我不相信。”他开始拉扯我身上的伤口，将懊恼与嫉妒倾泻在上面。慢慢地，鲜红的伤痕开始失去光泽，萎缩，然后被风化成干涸了的深潭。一个接着一个，这些坑洼开始自愈，最后平整成光滑的肌肤，年轻又稚嫩。而他和我目睹了整个过程。 “我把你治好了！”他错愕地惊叫。 “你没有治好我，”我解释道，“你杀死了我的爱人。而且，治愈只是暂时的：一旦黄昏再次降临，它们会重新喷涌而出，更加剧烈。但是下一次晚霞将不再是红色，而是一抹诡异的粉色。然后它将会向地上的人们袭来，贯通他们的双耳、双眼以及最宝贵的头脑；而人们会虔诚地下跪，向晚霞朝圣。这就是没有祭司的祭祀仪式，并且这种仪式将会成为和吃饭睡觉一样稀松平常的琐事，唯一不同的是只有在那个时候人们才会怀抱满腔的热血。那时，所有人身上的伤痕都会扩大，撕破血管，然后是器官，最后是他们自己；而伤痕中的血将会喷溅到粉色的晚霞上。可是你知道，无论添加多少猩红，粉色永远不会成为血液。” 他紧张地注视着我，仿佛一个等待宣判的死刑犯。 “不仅如此，龟裂的大地上会覆盖一层甜蜜的桃粉色，然后就会像伤痕一样扩大，一直撕裂到地心为止。但是在有草的地方，一个小时后血就会喷涌出来，两个小时后龟裂的地方就会开始呻吟。大地将会像失落的吟游诗人一样用不知名的语言反复地吟唱不知名的歌曲。但是人们只会听见大地的哭泣声。” “人们？” “是的，就是那些撕碎后的残片。他们会四处奔走，想要拼凑出一个完整的自己，因为他们内心深处是渴望年轻又稚嫩的皮肤的。” “那你呢？你不是爱着你的伤痕吗？” “我当然永远会。但是我不会去寻找它们。因为一个人，不管如何地被粉碎，在黄昏时分，伤痕总是会蠢蠢欲动，接着绽放在他残缺的身躯上，然后血液才会喷涌而出，让人们痛苦地呻吟。只是有些人惧怕痛楚，所以会拉扯着伤口让它愈合。” “我不怕痛苦，所以我能拥有你的伤口吗？”他执着地问道。 “已经没有意义了。”","categories":[],"tags":[{"name":"Novel","slug":"Novel","permalink":"http://charleyhut.github.io/tags/Novel/"}]},{"title":"Hello World","slug":"hello-world","date":"2023-01-26T05:08:28.976Z","updated":"2023-01-26T06:42:08.142Z","comments":true,"path":"2023/01/26/hello-world/","link":"","permalink":"http://charleyhut.github.io/2023/01/26/hello-world/","excerpt":"","text":"Hi guys!","categories":[],"tags":[{"name":"Gibberish","slug":"Gibberish","permalink":"http://charleyhut.github.io/tags/Gibberish/"}]}],"categories":[],"tags":[{"name":"Gibberish","slug":"Gibberish","permalink":"http://charleyhut.github.io/tags/Gibberish/"},{"name":"Novel","slug":"Novel","permalink":"http://charleyhut.github.io/tags/Novel/"}]}